{
  "about": {
    "greeting": "Salut ! Je suis",
    "description": "Je suis developpeur JavaScript/React.js passionne par le developpement web, pret a transformer des idees en solutions fonctionnelles. J'ai acquis des competences solides a travers des projets personnels et une formation ciblee, ce qui me permet d'apporter une approche dynamique et creative a chaque tache. Je suis enthousiaste a l'idee de collaborer sur des projets passionnants. Let's Connect !"
  },
  "skills": {
    "title": "Competences",
    "frontend": "Front-end",
    "figma": "Figma",
    "css": "CSS",
    "scss": "SCSS",
    "javascript": "JavaScript",
    "react": "React.JS",
    "backend": "Back-end",
    "mongodb": "MongoDB",
    "mysql": "MySQL",
    "node": "Node.JS",
    "other": "Autre",
    "github": "Git & GitHub"
  },
  "projects": {
    "title": "Side projects",
    "credentials": "Pour essayer les applications, vous pouvez utiliser les identifiants suivants :",
    "email": "e-mail",
    "password": "mot de passe",
    "note": "Parfois, vous devez attendre quelques secondes pour vous connecter, cela depend du reseau.",
    "openTaskHub": {
      "title": "OpenTaskHub",
      "description": "Application de gestion de projets et de tickets avec authentification, tableaux de suivi et espace de travail collaboratif en temps reel."
    },
    "socialMedia": {
      "title": "Social-Media",
      "description": "J'ai developpe une API RESTful pour gerer les publications, en integrant des fonctionnalites telles que le telechargement d'images, l'edition et la suppression de commentaires. En utilisant des techniques comme le spread operator, le rendu conditionnel et la gestion d'etat avec Redux Toolkit."
    },
    "notesChatApp": {
      "title": "Notes-Chat-app (en cours)",
      "description": "L'application Notes permet aux utilisateurs de creer des notes avec des fonctionnalites avancees telles que l'enregistrement dans une base MySQL, l'edition, la suppression et l'attribution de categories."
    },
    "eCommerceApp": {
      "title": "E-Commerce-app",
      "description": "J'ai concu ce site e-commerce pour ameliorer mes competences en React JS Hooks, notamment useContext et useReducer, qui facilitent la gestion efficace du panier d'achat."
    },
    "dashboardApp": {
      "title": "Dashboard-app",
      "description": "J'ai developpe ce tableau de bord en utilisant Express JS, MongoDB et React JS pour mieux maitriser la gestion de base de donnees et afficher des donnees via l'API Context."
    },
    "stepsApp": {
      "title": "Steps App",
      "description": "Une application web pour suivre vos pas quotidiens et surveiller vos progres au fil du temps. Developpee avec des technologies web modernes."
    }
  },
  "contact": {
    "title": "Contact",
    "name": "Nom",
    "email": "Email",
    "message": "Message",
    "submit": "Soumettre"
  }
}
